stress-test-aws.yml
config:
  target: "http://spot-a-fly-header-lb-1746509329.us-east-2.elb.amazonaws.com"
  phases:
    - duration: 30
      arrivalRate: 4
      name: "Warm up the application"
    - duration: 10
      arrivalRate: 15
      name: "High load"
    - duration: 30
      arrivalRate: 4
      name: "Normal load"
    - duration: 5
      arrivalRate: 20
      name: "Quick spike"
    - duration: 20
      arrivalRate: 3
      name: "Cool down"
  processor: "./stress-test-functions.js"
scenarios:
  - flow:
      - get:
          url: "/"
      - get:
          url: "/bundle.js"
      - loop:
        - function: "getRandomId"
        - get:
            url: "/data/artist?artistId={{ id }}"
        - function: "getRandomIdInLastHalf"
        - get:
            url: "/data/artist?artistId={{ id }}"
        - function: "getFrequentlyUsedId"
        - get:
            url: "/data/artist?artistId={{ id }}"
        - function: "getFrequentlyUsedId"
        - get:
            url: "/data/artist?artistId={{ id }}"
        count: 35